trunk/HSIM/iHub/Transient/dashboard/ExecuteDashboard

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <RequestId>0</RequestId>
    </soapenv:Header>
    <soapenv:Body>
        <GetDashboardUpdatedObjects xmlns="http://schemas.actuate.com/actuate11">
            <Object>
                <Name>/Dashboard/Contents/TPCHCrosstab.DASHBOARD</Name>
            </Object>
            <DashboardContext>
                <WebAppPath>null</WebAppPath>
                <AppBaseUrl>http://@-3:@-4/@-6/</AppBaseUrl>
                <iPortalID>@100</iPortalID>
                <HttpSessionId>@101</HttpSessionId>
            </DashboardContext>
            <Operation>
                <Operator>ExecuteDashboard</Operator>
                <Target>
                    <Id/>
                    <Type>Dashboard</Type>
                </Target>
                <Data>
                    <ParameterValues>
                        <ParameterValue>
                            <Name>Id</Name>
                            <Value>@300</Value>
                        </ParameterValue>
                        <ParameterValue>
                            <Name>Action</Name>
                            <Value>Run</Value>
                        </ParameterValue>
                    </ParameterValues>
                </Data>
            </Operation>
        </GetDashboardUpdatedObjects>
    </soapenv:Body>
</soapenv:Envelope>
